[Killed] BlockStatement
src/operacoes.js:17:22
   return Math.sqrt(n);
 }
 function restoDivisao(dividendo, divisor) { return dividendo % divisor; }
-function fatorial(n) {
-  if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
-  // if (n === 0 || n === 1) return 1;
-  let resultado = 1;
-  for (let i = 2; i <= n; i++) { resultado *= i; }
-  return resultado;
-}
+function fatorial(n) {}
 function mediaArray(numeros) {
   if (numeros.length === 0) return 0;
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js
  Suíte de Testes Fortalecida para 50 Operações Aritméticas
    √ 1. deve somar dois números positivos (4 ms)
    √ 2. deve subtrair dois números positivos (1 ms)

[Killed] ConditionalExpression
src/operacoes.js:34:7
 
 // === Bloco 2: Operações em Arrays e Checagens (11-20) ===
 function maximoArray(numeros) {
-  if (numeros.length === 0) throw new Error('Array vazio não possui valor máximo.');
+  if (false) throw new Error('Array vazio não possui valor máximo.');
   return Math.max(...numeros);
 }
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js
  Suíte de Testes Fortalecida para 50 Operações Aritméticas
    √ 1. deve somar dois números positivos (6 ms)
    √ 2. deve subtrair dois números positivos (1 ms)

[Killed] ConditionalExpression
src/operacoes.js:38:7
   return Math.max(...numeros);
 }
 function minimoArray(numeros) {
-  if (numeros.length === 0) throw new Error('Array vazio não possui valor mínimo.');
+  if (false) throw new Error('Array vazio não possui valor mínimo.');
   return Math.min(...numeros);
 }
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js

  Suíte de Testes Fortalecida para 50 Operações Aritméticas

[Killed] BlockStatement
src/operacoes.js:83:32
   if (n <= 1) return n;
   return fibonacci(n - 1) + fibonacci(n - 2);
 }
-function produtoArray(numeros) {
-  // if (numeros.length === 0) return 1;
-  return numeros.reduce((acc, val) => acc * val, 1);
-}
+function produtoArray(numeros) {}
 // function clamp(valor, min, max) {
 //   if (valor < min) return min;
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js

  Suíte de Testes Fortalecida para 50 Operações Aritméticas

[Killed] ArrowFunction
src/operacoes.js:85:25
 }
 function produtoArray(numeros) {
   // if (numeros.length === 0) return 1;
-  return numeros.reduce((acc, val) => acc * val, 1);
+  return numeros.reduce(() => undefined, 1);
 }
 // function clamp(valor, min, max) {
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js

  Suíte de Testes Fortalecida para 50 Operações Aritméticas

[Killed] ArithmeticOperator
src/operacoes.js:85:39
 }
 function produtoArray(numeros) {
   // if (numeros.length === 0) return 1;
-  return numeros.reduce((acc, val) => acc * val, 1);
+  return numeros.reduce((acc, val) => acc / val, 1);
 }
 // function clamp(valor, min, max) {
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js

  Suíte de Testes Fortalecida para 50 Operações Aritméticas

[Killed] BlockStatement
src/operacoes.js:92:33
 //   if (valor > max) return max;
 //   return valor;
 // }
-function clamp(valor, min, max) {
-  return Math.max(min, Math.min(max, valor));
-}
+function clamp(valor, min, max) {}
 function isDivisivel(dividendo, divisor) { return dividendo % divisor === 0; }
 function celsiusParaFahrenheit(celsius) { return (celsius * 9/5) + 32; }
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js

  Suíte de Testes Fortalecida para 50 Operações Aritméticas

[Killed] MethodExpression
src/operacoes.js:93:24
 //   return valor;
 // }
 function clamp(valor, min, max) {
-  return Math.max(min, Math.min(max, valor));
+  return Math.max(min, Math.max(max, valor));
 }
 function isDivisivel(dividendo, divisor) { return dividendo % divisor === 0; }
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js

  Suíte de Testes Fortalecida para 50 Operações Aritméticas

[Killed] MethodExpression
src/operacoes.js:93:10
 //   return valor;
 // }
 function clamp(valor, min, max) {
-  return Math.max(min, Math.min(max, valor));
+  return Math.min(min, Math.min(max, valor));
 }
 function isDivisivel(dividendo, divisor) { return dividendo % divisor === 0; }
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js

  Suíte de Testes Fortalecida para 50 Operações Aritméticas

[Killed] ConditionalExpression
src/operacoes.js:111:7
 function isMenorQue(a, b) { return a < b; }
 function isEqual(a, b) { return a === b; }
 function medianaArray(numeros) {
-  if (numeros.length === 0) throw new Error('Array vazio não possui mediana.');
+  if (true) throw new Error('Array vazio não possui mediana.');
   const sorted = [...numeros].sort((a, b) => a - b);
   const mid = Math.floor(sorted.length / 2);
killedBy: All tests
statusReason: > operacoes-mutante-lab@1.0.0 test
> jest


FAIL test/operacoes.test.js

  Suíte de Testes Fortalecida para 50 Operações Aritméticas
