[Survived] StringLiteral
src/operacoes.js:8:32
-     if (b === 0) throw new Error('Divisão por zero não é permitida.');
+     if (b === 0) throw new Error("");

[Survived] EqualityOperator
src/operacoes.js:13:7
-     if (n < 0) throw new Error('Não é possível calcular a raiz quadrada de um número negativo.');
+     if (n <= 0) throw new Error('Não é possível calcular a raiz quadrada de um número negativo.');

[Survived] ConditionalExpression
src/operacoes.js:13:7
-     if (n < 0) throw new Error('Não é possível calcular a raiz quadrada de um número negativo.');
+     if (false) throw new Error('Não é possível calcular a raiz quadrada de um número negativo.');

[Survived] StringLiteral
src/operacoes.js:13:30
-     if (n < 0) throw new Error('Não é possível calcular a raiz quadrada de um número negativo.');
+     if (n < 0) throw new Error("");

[Survived] EqualityOperator
src/operacoes.js:18:7
-     if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
+     if (n <= 0) throw new Error('Fatorial não é definido para números negativos.');

[Survived] ConditionalExpression
src/operacoes.js:18:7
-     if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
+     if (false) throw new Error('Fatorial não é definido para números negativos.');

[Survived] StringLiteral
src/operacoes.js:18:30
-     if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
+     if (n < 0) throw new Error("");

[Survived] ConditionalExpression
src/operacoes.js:19:7
-     if (n === 0 || n === 1) return 1;
+     if (false) return 1;

[Survived] LogicalOperator
src/operacoes.js:19:7
-     if (n === 0 || n === 1) return 1;
+     if (n === 0 && n === 1) return 1;

[Survived] ConditionalExpression
src/operacoes.js:19:7
-     if (n === 0 || n === 1) return 1;
+     if (false || n === 1) return 1;

[Survived] ConditionalExpression
src/operacoes.js:19:18
-     if (n === 0 || n === 1) return 1;
+     if (n === 0 || false) return 1;

[Survived] ConditionalExpression
src/operacoes.js:25:7
-     if (numeros.length === 0) return 0;
+     if (false) return 0;

[Survived] ConditionalExpression
src/operacoes.js:34:7
-     if (numeros.length === 0) throw new Error('Array vazio не possui valor máximo.');
+     if (false) throw new Error('Array vazio не possui valor máximo.');

[Survived] StringLiteral
src/operacoes.js:34:45
-     if (numeros.length === 0) throw new Error('Array vazio не possui valor máximo.');
+     if (numeros.length === 0) throw new Error("");

[Survived] StringLiteral
src/operacoes.js:38:45
-     if (numeros.length === 0) throw new Error('Array vazio не possui valor mínimo.');
+     if (numeros.length === 0) throw new Error("");

[Survived] ConditionalExpression
src/operacoes.js:38:7
-     if (numeros.length === 0) throw new Error('Array vazio не possui valor mínimo.');
+     if (false) throw new Error('Array vazio не possui valor mínimo.');

[Survived] ConditionalExpression
src/operacoes.js:43:28
-   function isPar(n) { return n % 2 === 0; }
+   function isPar(n) { return true; }

[Survived] ConditionalExpression
src/operacoes.js:44:30
-   function isImpar(n) { return n % 2 !== 0; }
+   function isImpar(n) { return true; }

[Survived] ArithmeticOperator
src/operacoes.js:44:30
-   function isImpar(n) { return n % 2 !== 0; }
+   function isImpar(n) { return n * 2 !== 0; }

[Survived] ConditionalExpression
src/operacoes.js:73:7
-     if (n <= 1) return false;
+     if (false) return false;

[Survived] EqualityOperator
src/operacoes.js:73:7
-     if (n <= 1) return false;
+     if (n < 1) return false;

[Survived] ConditionalExpression
src/operacoes.js:74:19
-     for (let i = 2; i < n; i++) {
+     for (let i = 2; false; i++) {

[Survived] BooleanLiteral
src/operacoes.js:73:22
-     if (n <= 1) return false;
+     if (n <= 1) return true;

[Survived] EqualityOperator
src/operacoes.js:74:19
-     for (let i = 2; i < n; i++) {
+     for (let i = 2; i >= n; i++) {

[Survived] BlockStatement
src/operacoes.js:74:31
-     for (let i = 2; i < n; i++) {
-       if (n % i === 0) return false;
-     }
+     for (let i = 2; i < n; i++) {}

[Survived] ArithmeticOperator
src/operacoes.js:75:9
-       if (n % i === 0) return false;
+       if (n * i === 0) return false;

[Survived] ConditionalExpression
src/operacoes.js:75:9
-       if (n % i === 0) return false;
+       if (false) return false;

[Survived] BooleanLiteral
src/operacoes.js:75:29
-       if (n % i === 0) return false;
+       if (n % i === 0) return true;

[Survived] ConditionalExpression
src/operacoes.js:84:7
-     if (numeros.length === 0) return 1;
+     if (false) return 1;

[Survived] ConditionalExpression
src/operacoes.js:88:7
-     if (valor < min) return min;
+     if (false) return min;

[Survived] EqualityOperator
src/operacoes.js:88:7
-     if (valor < min) return min;
+     if (valor <= min) return min;

[Survived] ConditionalExpression
src/operacoes.js:89:7
-     if (valor > max) return max;
+     if (false) return max;

[Survived] EqualityOperator
src/operacoes.js:89:7
-     if (valor > max) return max;
+     if (valor >= max) return max;

[Survived] ConditionalExpression
src/operacoes.js:92:51
-   function isDivisivel(dividendo, divisor) { return dividendo % divisor === 0; }
+   function isDivisivel(dividendo, divisor) { return true; }

[Survived] ArithmeticOperator
src/operacoes.js:93:51
-   function celsiusParaFahrenheit(celsius) { return (celsius * 9/5) + 32; }
+   function celsiusParaFahrenheit(celsius) { return (celsius * 9 * 5) + 32; }

[Survived] ArithmeticOperator
src/operacoes.js:93:51
-   function celsiusParaFahrenheit(celsius) { return (celsius * 9/5) + 32; }
+   function celsiusParaFahrenheit(celsius) { return (celsius / 9/5) + 32; }

[Survived] ArithmeticOperator
src/operacoes.js:94:53
-   function fahrenheitParaCelsius(fahrenheit) { return (fahrenheit - 32) * 5/9; }
+   function fahrenheitParaCelsius(fahrenheit) { return (fahrenheit - 32) * 5 * 9; }

[Survived] ArithmeticOperator
src/operacoes.js:94:53
-   function fahrenheitParaCelsius(fahrenheit) { return (fahrenheit - 32) * 5/9; }
+   function fahrenheitParaCelsius(fahrenheit) { return (fahrenheit - 32) / 5/9; }

[Survived] ConditionalExpression
src/operacoes.js:96:7
-     if (n === 0) throw new Error('Não é possível inverter o número zero.');
+     if (false) throw new Error('Não é possível inverter o número zero.');

[Survived] StringLiteral
src/operacoes.js:96:32
-     if (n === 0) throw new Error('Não é possível inverter o número zero.');
+     if (n === 0) throw new Error("");

[Survived] ConditionalExpression
src/operacoes.js:104:36
-   function isMaiorQue(a, b) { return a > b; }
+   function isMaiorQue(a, b) { return true; }

[Survived] EqualityOperator
src/operacoes.js:104:36
-   function isMaiorQue(a, b) { return a > b; }
+   function isMaiorQue(a, b) { return a >= b; }

[Survived] EqualityOperator
src/operacoes.js:105:36
-   function isMenorQue(a, b) { return a < b; }
+   function isMenorQue(a, b) { return a <= b; }

[Survived] ConditionalExpression
src/operacoes.js:105:36
-   function isMenorQue(a, b) { return a < b; }
+   function isMenorQue(a, b) { return true; }

[Survived] ConditionalExpression
src/operacoes.js:106:33
-   function isEqual(a, b) { return a === b; }
+   function isEqual(a, b) { return true; }

[Survived] ConditionalExpression
src/operacoes.js:108:7
-     if (numeros.length === 0) throw new Error('Array vazio не possui mediana.');
+     if (false) throw new Error('Array vazio не possui mediana.');

[Survived] MethodExpression
src/operacoes.js:109:18
-     const sorted = [...numeros].sort((a, b) => a - b);
+     const sorted = [...numeros];

[Survived] StringLiteral
src/operacoes.js:108:45
-     if (numeros.length === 0) throw new Error('Array vazio не possui mediana.');
+     if (numeros.length === 0) throw new Error("");

[Survived] ArrowFunction
src/operacoes.js:109:36
-     const sorted = [...numeros].sort((a, b) => a - b);
+     const sorted = [...numeros].sort(() => undefined);

[Survived] ArithmeticOperator
src/operacoes.js:109:46
-     const sorted = [...numeros].sort((a, b) => a - b);
+     const sorted = [...numeros].sort((a, b) => a + b);

[Survived] ConditionalExpression
src/operacoes.js:111:7
-     if (sorted.length % 2 === 0) {
+     if (false) {

[Survived] ArithmeticOperator
src/operacoes.js:112:12
-       return (sorted[mid - 1] + sorted[mid]) / 2;
+       return (sorted[mid - 1] + sorted[mid]) * 2;

[Survived] BlockStatement
src/operacoes.js:111:32
-     if (sorted.length % 2 === 0) {
-       return (sorted[mid - 1] + sorted[mid]) / 2;
-     }
+     if (sorted.length % 2 === 0) {}

[Survived] ArithmeticOperator
src/operacoes.js:111:7
-     if (sorted.length % 2 === 0) {
+     if (sorted.length * 2 === 0) {

[Survived] ArithmeticOperator
src/operacoes.js:112:13
-       return (sorted[mid - 1] + sorted[mid]) / 2;
+       return (sorted[mid - 1] - sorted[mid]) / 2;

[Survived] ArithmeticOperator
src/operacoes.js:112:20
-       return (sorted[mid - 1] + sorted[mid]) / 2;
+       return (sorted[mid + 1] + sorted[mid]) / 2;
